export const require_major = [
    {
        label: 'ไม่จำกัดหลักสูตร',
        value: 'ไม่จำกัดหลักสูตร',
    },
    {
        label: 'วิศวกรรมศาสตร์',
        options: [
            {
                label: 'วิศวกรรมการวัดคุม',
                value: 'วิศวกรรมการวัดคุม',
            },
            {
                label: 'วิศวกรรมอัตโนมัติ',
                value: 'วิศวกรรมอัตโนมัติ',
            },
            {
                label: 'วิศวกรรมระบบควบคุม',
                value: 'วิศวกรรมระบบควบคุม',
            },
            {
                label: 'วิศวกรรมแมคคาทรอนิกส์',
                value: 'วิศวกรรมแมคคาทรอนิกส์',
            },
            {
                label: 'วิศวกรรมเมคคาทรอนิกส์และออโตเมชัน',
                value: 'วิศวกรรมเมคคาทรอนิกส์และออโตเมชัน',
            },
            {
                label: 'วิศวกรรมคอมพิวเตอร์',
                value: 'วิศวกรรมคอมพิวเตอร์',
            },
            {
                label: 'วิศวกรรมสารสนเทศ',
                value: 'วิศวกรรมสารสนเทศ',
            },
            {
                label: 'วิศวกรรมดนตรีและสื่อประสม',
                value: 'วิศวกรรมดนตรีและสื่อประสม',
            },
            {
                label: 'วิศวกรรมระบบไอโอทีและสารสนเทศ',
                value: 'วิศวกรรมระบบไอโอทีและสารสนเทศ',
            },
            {
                label: 'วิศวกรรมเครื่องกล',
                value: 'วิศวกรรมเครื่องกล',
            },
            {
                label: 'วิศวกรรมขนส่งทางราง',
                value: 'วิศวกรรมขนส่งทางราง',
            },
            {
                label: 'วิศวกรรมเคมี',
                value: 'วิศวกรรมเคมี',
            },
            {
                label: 'วิศวกรรมปิโตรเคมี',
                value: 'วิศวกรรมปิโตรเคมี',
            },
            {
                label: 'วิศวกรรมไฟฟ้า',
                value: 'วิศวกรรมไฟฟ้า',
            },
            {
                label: 'วิศวกรรมพลังงานไฟฟ้า',
                value: 'วิศวกรรมพลังงานไฟฟ้า',
            },
            {
                label: 'วิศวกรรมอุตสาหการ',
                value: 'วิศวกรรมอุตสาหการ',
            },
            {
                label: 'วิศวกรรมออกแบบการผลิตและวัสดุ',
                value: 'วิศวกรรมออกแบบการผลิตและวัสดุ',
            },
            {
                label: 'วิศวกรรมอาหาร',
                value: 'วิศวกรรมอาหาร',
            },
            {
                label: 'วิศวกรรมอิเล็กทรอนิกส์',
                value: 'วิศวกรรมอิเล็กทรอนิกส์',
            },
            {
                label: 'วิศวกรรมโทรคมนาคม',
                value: 'วิศวกรรมโทรคมนาคม',
            },
            {
                label: 'วิศวกรรมโทรคมนาคมและโครงข่าย',
                value: 'วิศวกรรมโทรคมนาคมและโครงข่าย',
            },
            {
                label: 'วิศวกรรมไฟฟ้าสื่อสารและอิเล็กทรอนิกส์',
                value: 'วิศวกรรมไฟฟ้าสื่อสารและอิเล็กทรอนิกส์',
            },
            {
                label: 'วิศวกรรมไฟฟ้าสื่อสารและเครือข่าย',
                value: 'วิศวกรรมไฟฟ้าสื่อสารและเครือข่าย',
            },
            {
                label: 'วิศวกรรมโยธา',
                value: 'วิศวกรรมโยธา',
            },
            {
                label: 'วิศวกรรมเกษตร',
                value: 'วิศวกรรมเกษตร',
            },
            {
                label: 'วิศวกรรมระบบอุตสาหกรรมการเกษตร',
                value: 'วิศวกรรมระบบอุตสาหกรรมการเกษตร',
            },
            {
                label: 'วิศวกรรมเกษตรอัจฉริยะ',
                value: 'วิศวกรรมเกษตรอัจฉริยะ',
            },
        ],
    },
];

export const welfare_options = [
    { label: 'ที่พัก', value: 'ที่พัก' },
    { label: 'รถรับส่ง', value: 'รถรับส่ง' },
    { label: 'ชุดทำงาน', value: 'ชุดทำงาน' },
    { label: 'อาหารกลางวัน', value: 'อาหารกลางวัน' },
    { label: 'ค่าเดินทาง', value: 'ค่าเดินทาง' },
];